In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

df['Name'] = ['Alice','Buttler']
df['Age'] = [25,24]
df['Income'] = [455522.22, 224115.25]
df

      Name  Age     Income
0    Alice   25  455522.22
1  Buttler   24  224115.25

In [5]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [7]:
df.index = [100,200]
df.index
df

        Name  Age     Income
100    Alice   25  455522.22
200  Buttler   24  224115.25

In [ ]:
df.columns
# print(df.columns[0]) --> Name

Index(['Name', 'Age', 'Income'], dtype='object')

In [14]:
df.to_numpy()

array([['Alice', 25, 455522.22],
       ['Buttler', 24, 224115.25]], dtype=object)

In [15]:
df.ndim

2

In [16]:
df.size

6

In [17]:
df.shape

(2, 3)

In [6]:
df.head()
#df.head(1)

      Name  Age     Income
0    Alice   25  455522.22
1  Buttler   24  224115.25

In [ ]:
df.at[1, 'Age'] #single value for row-column pair

np.int64(24)

In [ ]:
df.iat[1, 1] #single value for row-column integer pair

np.int64(24)